reddit_clone/reddit_clone/app/controllers/posts_controller.rb

  def new
    # @post = Post.new
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"