reddit_clone/reddit_clone/app/controllers/subs_controller.rb

  def create
    sub = Sub.new(sub_params)
    sub.user_id = current_user.id
    if sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fdsafdsafsa"], ["description", " fdafsfdsfdsfasd grweyre"], ["user_id", 4], ["created_at", "2018-11-21 00:52:47.073708"], ["updated_at", "2018-11-21 00:52:47.073708"]]

  def update
    @sub = Sub.find_by(id: params[:id])

    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Meatballll"], ["description", "to be or not to be that is the question"], ["updated_at", "2018-11-21 00:56:54.482869"], ["id", 1]]

  def ensure_moderator
    @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]